{
  "latestVersion": {
    "version": "1.2.0-stable",
    "phase": "stable",
    "releaseDate": "2023 March 09",
    "artwork": "/assets/other/release artworks/whats-new-v1.2.0-stable.webp",
    "importantNotes": [
      "This release provides accessibility improvements throughout Nora."
    ]
  },
  "versions": [
    {
      "version": "1.2.0-stable",
      "releaseDate": "2023 March 09",
      "notes": {
        "new": [
          {
            "note": "Added a new App Stats section to the About section of the Settings Page."
          },
          {
            "note": "Added a new notification type that shows the progression of the song parsing process and song deletion process."
          },
          {
            "note": "Added a 'See All' button for Recently Added Songs and Recently Played Songs sections in Home Page."
          },
          {
            "note": "Added the functionality to change the increment interval of the scroll event when hovered over audio and volume seek bars."
          },
          {
            "note": "Added a volume seek bar to the Mini-Player."
          },
          { "note": "Revamped some settings in the Settings Page." },
          {
            "note": "Improved performance in pages when loading with bigger libaries."
          }
        ],
        "fixed": [
          {
            "note": "Fixed a bug where Lyrics Page shows the button to 'show saved lyrics' when there aren't any in the audio file."
          },
          {
            "note": "Fixed a bug where user can't save lyrics for songs outside the library."
          },
          {
            "note": "Fixed a bug where songs outside the library shows 'unknown title' without showing the audio file name when the title tag is empty."
          },
          {
            "note": "Fixed a bug where folders with higher privileges such as 'System Volume Information' prevent adding them to the app."
          },
          {
            "note": "Fixed a bug where pressing F5 reloads the app even though the window isn't focused."
          },
          {
            "note": "Fixed a bug where clicking the close button in Mini-player closes the app even though 'Close to system tray' is enabled."
          },
          {
            "note": "Fixed a bug where Folders Page shows 'unknown folder name' without showing the folder path when an external drive is added as a folder."
          },
          {
            "note": "Fixed a bug where Release Notes Prompt's important notes aren't positioned properly inside the container."
          },
          {
            "note": "Fixed a bug where Albums Page shows more than required album columns."
          },
          {
            "note": "Improved performance of the app when opening songs from the file explorer."
          },
          {
            "note": "Improved the functionality when restoring blacklisted songs."
          },
          { "note": "Improved accessibility features of the app." },
          { "note": "Updated the UI in Genre Info Page and Album Info Page." },
          { "note": "Updated app dependencies." }
        ],
        "knownIssues": [
          {
            "note": "Sometimes users can get unexpected search results when using Search."
          },
          {
            "note": "App theme will be changed when you change your system's theme even though you didn't select to use system theme in the app."
          },
          {
            "note": "If a song is added next to the last song of the queue, the last song won't be played."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          }
        ]
      }
    },
    {
      "version": "1.1.0-stable",
      "releaseDate": "2023 February 26",
      "notes": {
        "new": [
          { "note": "Support for editing audio files outside the library." },
          {
            "note": "Support for further customizations when downloading song metadata from the internet."
          },
          {
            "note": "Support for folder blacklisting and improvements for song blacklisting."
          },
          {
            "note": "Added an indicator to show whether an artist is liked or not."
          },
          {
            "note": "Added new keyboard shortcuts to go to forward and backward pages and to change app theme."
          },
          {
            "note": "New BlacklistFolderConfirmPrompt and improvements for BlacklistSongConfirmPrompt."
          },
          {
            "note": "Support for audio seeking or changing the volume through mouse scrolling by hovering over the seek bar and the volume bar."
          }
        ],
        "fixed": [
          {
            "note": "Improvements for error handling related to network requests."
          },
          { "note": "Removed Backlisted Songs section in the Settings Page." },
          {
            "note": "Fixed a bug where Mini Player show un-scrollable unsynchronized lyrics."
          },
          {
            "note": "Fixed a bug where artworks without 1:1 aspect ratio breaks the alignment of how the songs are displayed."
          },
          {
            "note": "Added a new sort option for SongsPage and FoldersPage to sort blacklisted and whitelisted folders and songs."
          },
          {
            "note": "Fixed a bug where temp artworks aren't getting cleaned up after the app closes."
          },
          { "note": "Fixed a bug where artists aren't being sorted properly." },
          {
            "note": "Fixed some bugs where some pages not updating its contents according to data events."
          },
          {
            "note": "Fixed a bug where removing a song doesn't trigger 'playlists' and 'genres' data events."
          },
          {
            "note": "Fixed a bug where some artist sort options aren't working as expected."
          },
          {
            "note": "Fixed a bug where toggling 'like song' in Song or SongCard doesn't get updated in the currentSongData and vice versa."
          },
          {
            "note": "Fixed a bug where Artist not showing default artist cover when there is no artwork for an artist."
          },
          {
            "note": "Fixed a bug where FoldersPage doesn't get updated when song gets deleted or added."
          },
          {
            "note": "Fixed a bug where online lyrics is not being saved to the audio file."
          },
          {
            "note": "Fixed a bug where some pages like HomePage, CurrentQueuePage not updating songs when a song gets blacklisted."
          },
          { "note": "Reduced image file sizes by using them in webp format." },
          { "note": "Removed change theme button on the title bar." },
          { "note": "Updated Musixmatch Lyrics Disclaimer." }
        ],
        "knownIssues": [
          {
            "note": "Sometimes users can get unexpected search results when using Search."
          },
          {
            "note": "App theme will be changed when you change your system's theme even though you didn't select to use system theme in the app."
          },
          {
            "note": "If a song is added next to the last song of the queue, the last song won't be played."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          }
        ]
      }
    },
    {
      "version": "1.0.0-stable",
      "releaseDate": "2023 February 17",
      "notes": {
        "new": [
          {
            "note": "Now Nora can read and write to audio files with synchronisedLyrics meta tag (Experimental)."
          },
          {
            "note": "Lyrics from Musixmatch. (Experimental)"
          },
          {
            "note": "Metadata of Musixmatch for songs now include artworks from Spotify."
          },
          {
            "note": "Auto-scrolling of synced lyrics can be toggled now in the LyricsPage."
          },
          {
            "note": "Added a new feature to allow users to select whether the app window should hide to system tray or close on clicking the close button."
          },
          {
            "note": "Added a new feature to allow users to determine whether the app should start as hidden during when on at startup is enabled."
          },
          {
            "note": "Added an entry to the system tray with some controls of the app such as show/hide and exit."
          },
          {
            "note": "Added a new button to refresh lyrics so that if incorrect lyrics is shown it will re-fetch the correct lyrics."
          },
          {
            "note": "Now LyricsPage will show the copyright info of the lyrics at the bottom of the page."
          },
          {
            "note": "Added a new button to show offline lyrics when after user have requested for the online lyrics."
          },
          { "note": "Added a new AppShortcutsPrompt that show app shortcuts." },
          { "note": "Added a setting to change Musixmatch token." },
          { "note": "Added support to get metadata for songs from iTunes." },
          {
            "note": "Added the functionality to start selecting multiple items by holding shift key and selecting an item."
          },
          {
            "note": "Added support for sorting on pages such as AlbumsPage, FoldersPage, AlbumsInfoPage etc."
          },
          { "note": "Added new FoldersPage to side bar of the app." },
          { "note": "Added new MusicFolderInfoPage for songs in folders." },
          { "note": "Added a Clear All button for notification panel." },
          {
            "note": "Added new button to save online lyrics to song from LyricsPage."
          },
          {
            "note": "Added a new title bar for the LyricsPage that shows new buttons that provides features such as Save online lyrics etc."
          },
          { "note": "Added Synced Lyrics to Mini Player." },
          {
            "note": "Added support for experimental feature that allows users to search multiple keywords in SearchPage."
          },
          { "note": "Now users can toggle artists as favorites." },
          { "note": "Added a new default artwork for albums." },
          { "note": "Improved search functionality" },
          {
            "note": "Added the feature to disable new update alerts."
          },
          {
            "note": "Added a new feature where artists artworks can be showed on the audio-controls panel."
          },
          {
            "note": "Now most relevant results in SearchPage will be more relevant to the search query."
          },
          { "note": "Added a network connection indicator on the TitleBar." },
          {
            "note": "Now users can fetch song metadata from internet and update their songs. (Experimental)"
          },
          { "note": "Support for Synced Lyrics." },
          {
            "note": "Now users can go back and forward when going through different pages. (Experimental)"
          },
          {
            "note": "Now users can select multiple songs, artists etc and do specific tasks with them. (Experimental)"
          },
          {
            "note": "New background artworks when viewing ArtistsPage, SongInfoPage etc."
          },
          { "note": "Now users can add artworks to user-created playlists." },
          {
            "note": "Support for recording listening patterns. (Experimental)"
          },
          {
            "note": "New metrics about listening patterns of a song in SongInfoPage. (Experimental)"
          },
          { "note": "Now users can clear search history results." },
          {
            "note": "Now users can play songs in a specific genre directly from the GenreInfoPage."
          },
          { "note": "Ability to sort songs relative to the released year." },
          { "note": "Song component now displays the song released year." }
        ],
        "fixed": [
          {
            "note": "Improved musixmatch lyrics matching which helps to send correct lyrics for songs."
          },
          { "note": "Reduced font size on context menu items." },
          { "note": "Updated the UI of some components of the app." },
          {
            "note": "Updated app dependencies, removed unnecessary dependencies and fixed some dependency vulnerabilities."
          },
          { "note": "Updated styles of some components." },
          {
            "note": "Updated the maximum dimensions that can be achieved by the Mini Player."
          },
          { "note": "Improved app updates functionality." },
          {
            "note": "Fixed a styling issue where material symbols show icon text instead of icon until it loads its resources."
          },
          {
            "note": "Fixed a bug where resetting the app while parsing the library wouldn't stop the parsing process."
          },
          {
            "note": "Fixed a bug where the app opens the ReleaseNotesPrompt even though there is no new update to the app."
          },
          {
            "note": "Fixed a bug where the app won't start with the previously played song position after an app restart."
          },
          {
            "note": "Fixed a bug where resetting the app doesn't remove the listening_data.json file."
          },
          {
            "note": "Fixed a bug where shuffle state is not saved when the app is closing."
          },
          {
            "note": "Fixed a bug where toggling mute state doesn't work when using the keyboard shortcuts."
          },
          {
            "note": "Fixed a bug where deleting a currently playing song puts the app in an infinite loop of errors."
          },
          {
            "note": "Fixed a bug where HomePage isn't getting updated when a recently played song got deleted."
          },
          { "note": "Fixed a bug where lyrics are shown with a small delay." },
          {
            "note": "Fixed a bug where song controls show incorrect metrics such as showing that the song is paused even though the song is playing."
          },
          {
            "note": "Fixed a bug where song listening data is not getting recorded."
          },
          {
            "note": "Fixed a bug where resources are not being loaded due to resource urls having query parameters."
          },
          {
            "note": "Fixed a bug where app shows the error prompt when a user deletes a song."
          },
          {
            "note": "Fixed a styling issue where 'drop song here' message prompt not positioned correctly."
          },
          {
            "note": "Fixed a bug where components re-render (flicker) even though they didn't get any new data."
          },
          {
            "note": "Fixed a bug where some keyboard shortcuts not working when in MiniPlayer."
          },
          {
            "note": "Fixed a bug where notifications doesn't get removed when reduced motion is enabled."
          },
          {
            "note": "Fixed a bug where app is looking for search results with empty strings or strings with only spaces."
          },
          {
            "note": "Fixed a bug where listening data metrics graph in SongInfoPage not displaying metrics."
          },
          {
            "note": "Fixed a bug where mediaSession controls are not working as intended."
          },
          { "note": "Fixed some styling issues in Song and SongsPage." },
          {
            "note": "Fixed a bug where song component in some pages not showing song year."
          },
          {
            "note": "Fixed a bug where lyrics in MiniPlayer not positioning to the center."
          },
          {
            "note": "Fixed a bug where ReleaseNotesPrompt shows that the app is in latest version even though there is no network connection."
          },
          { "note": "Fixed an overflowing issue on some pages." },
          {
            "note": "Fixed a bug where updating an artwork on a song wouldn't show it on the app instantly due to image caching."
          },
          {
            "note": "Fixed a bug where lyrics not showing instrumental gaps of a song in lyrics."
          },
          {
            "note": "Fixed a bug where lyrics are not being identified as synced."
          },
          {
            "note": "Fixed a bug on CurrentQueuePage where current playing song is not positioned correctly."
          },
          { "note": "Fixed some text styling issues on PlaylistInfoPage." },
          {
            "note": "Fixed a bug on ConfirmDeletePlaylist prompt not positioning elements correctly."
          },
          {
            "note": "Fixed a bug where blacklisted song showing an incorrect index."
          },
          {
            "note": "Fixed a bug on render process where, memory leak occurs due to subscribing for max no. of preload's event listeners."
          },
          {
            "note": "Fixed a bug where clicking on Artist doesn't direct to ArtistsInfoPage."
          },
          {
            "note": "Fixed a bug where clicking on Genre doesn't direct to GenresInfoPage."
          },
          {
            "note": "Fixed a bug on PromptMenu where it doesn't wait for the fade out animation to end to clear content on the PromptMenu."
          },
          {
            "note": "Fixed a bug on MostRelevantResult where clicking on it doesn't direct to the specified info page."
          },
          {
            "note": "Fixed a bug on PromptMenu where prompt menus opened in full-screen or in maximized windows will make its content appear blurred."
          },
          { "note": "Fixed Artist component showing wrong default artwork." },
          { "note": "Fixed some contrast issues on GenreInfoPage." },
          {
            "note": "Fixed a bug where Prompts are not positioning Button components correctly."
          },
          {
            "note": "Fixed a styling issue on Playlist component where when hovered, shows an overflowed gradient."
          },
          {
            "note": "Fixed SongArtwork component on SongTagsEditingPage not positioning its buttons correctly."
          },
          {
            "note": "Fixed NetworkIndicator not updating its state as intended."
          },
          {
            "note": "Fixed a bug in Playlist where clicking on it wouldn't direct to the PlaylistInfoPage."
          }
        ],
        "knownIssues": [
          {
            "note": "Sometimes users can get unexpected search results when using Search."
          },
          {
            "note": "App theme will be changed when you change your system's theme even though you didn't select to use system theme in the app."
          },
          {
            "note": "If a song is added next to the last song of the queue, the last song won't be played."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          }
        ]
      }
    },
    {
      "version": "0.8.0-alpha",
      "releaseDate": "2022 August 19",
      "notes": {
        "new": [
          {
            "note": "Double-clicking on a supported song in the File Explorer would play it on the app. Be sure if you made Nora the default audio player for the respective audio file. (Experimental)"
          },
          {
            "note": "Now users can drag and drop a supported audio file to play it on the player. (Experimental)"
          },
          {
            "note": "Now users can edit song id3 tags. (Experimental)"
          },
          {
            "note": "Greatly improved app performance when opening large audio libraries in pages."
          },
          {
            "note": "Theme switching according the system theme."
          },
          {
            "note": "Now users can select whether the song duration or the song remaining duration should be displayed."
          },
          {
            "note": "Updated taskbar thumbnail buttons to support the system theme."
          },
          {
            "note": "App now checks for updates every 15 minutes and inform the user if an update is available."
          }
        ],
        "fixed": [
          {
            "note": "Updated the app installer and reduced the file size of the installer by 13%."
          },
          {
            "note": "Fixed a bug where editing song tags could remove the artwork of a song."
          },
          {
            "note": "Fixed a bug where using search features on songs metadata editing page updates the search history."
          },
          {
            "note": "Fixed a bug where adding a previously parsed folder would parse the same folder."
          }
        ],
        "knownIssues": [
          {
            "note": "Parsing a big music library could sometimes make the app unresponsive. Currently, the only solution is to wait some time until the parsing process finishes and the app regains responsiveness."
          },
          {
            "note": "App theme will be changed when you change your system's theme even though you didn't select to use system theme in the app."
          },
          {
            "note": "Lyrics on some songs aren't being read by the app. Still you will be able to see lyrics from the internet."
          },
          {
            "note": "If a song is added next to the last song of the queue, the last song won't be played."
          },
          {
            "note": "Trying to play corrupted songs will make the app player unusable. Workaround is to play the next song and restart the renderer using F5 button."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          }
        ]
      }
    },
    {
      "version": "0.7.0-alpha",
      "releaseDate": "2022 July 29",
      "notes": {
        "new": [
          {
            "note": "Now you can play .ogg and .wav files in the app. (Experimental)"
          },
          {
            "note": "Added a new Release Notes Page to check for app updates and to see what the updates change in the app."
          },
          {
            "note": "Rewrote the whole app's UI with TailwindCSS. This migration revamped the whole UI of the app and updated the components and pages to be responsive to different screen sizes. (Experimental)"
          },
          {
            "note": "Option to view open source licenses used by the app."
          },
          {
            "note": "Diamensions and positions of the windows will now be saved."
          },
          {
            "note": "Updated the search functionality of the app. Now users can see their recent searches for content. Search will suggest keywords if you typed something wrong in the search bar. Now Search supports results from Genres."
          },
          {
            "note": "Songs and artists you love most are now on your home page."
          },
          {
            "note": "Updated notifications with improved UI and UX that supports buttons to provide additional functionality."
          },
          {
            "note": "Added all-time most and least listened, monthly most and least listened and artist name as sort options for songs."
          },
          {
            "note": "Now the app will be more responsive towards newtwork interruptions and act accordingly without giving you a headache."
          },
          {
            "note": "Now pages are more responsive to data updates."
          },
          {
            "note": "Now users can make the mini player stay on top of other windows."
          },
          {
            "note": "Playlists with full functionality is here. Now users can create new playlists, add songs to them, remove songs inside them or delete playlists completely. This is huge success when compared to the previous version."
          },
          {
            "note": "Users now can clear the song history from the app."
          },
          {
            "note": "Now the way users sort content will be saved to provide easier access to content that they need most."
          },
          {
            "note": "Added a new volume fade transition when the user toggles between play and pause of a song. (Experiemental)"
          },
          {
            "note": "New prompt to verify links before directing users to the link."
          }
        ],
        "fixed": [
          {
            "note": "Improved the algorithm used to shuffle the queue and playlists. Now songs in them should be more random."
          },
          {
            "note": "Improved data updates detection."
          },
          {
            "note": "Fixed some bugs related to parsing songs, blacklisting a song and restoring songs from the blacklist."
          },
          {
            "note": "Fixed a bug where parsing a song after a read error would parse the song two times."
          },
          {
            "note": "Fixed a bug related to resetting the app."
          },
          {
            "note": "Improved the song parsing process of the app."
          },
          {
            "note": "Fixed some bugs related to the player."
          },
          {
            "note": "Fixed a bug where deleting a song from the library or deleting from the system wouldn't update the library."
          },
          {
            "note": "Updated various components with improved UI and UX."
          },
          {
            "note": "Updated the songs tags editing page and fixed some bugs related to editing the tags of the song."
          }
        ],
        "knownIssues": [
          {
            "note": "Editing song tags could remove the artwork of the song."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          },
          {
            "note": "There is still a small amount of unwanted cpu consumption due to over-rendering of components."
          }
        ]
      }
    },
    {
      "version": "0.6.0-alpha",
      "releaseDate": "2022 June 24",
      "notes": {
        "new": [
          {
            "note": "Added the support to edit song id3 tags. Right click on a song and click Edit songs tags to go to the SongID3TagEditorPage. Currently changes to those data wouldn't be updated on the app. (Experimental)"
          },
          {
            "note": "Added the basement to provide support for m3u files to import and export playlists."
          },
          {
            "note": "Artist artworks will be updated when the user listens to their songs."
          },
          {
            "note": "Added keyboard shortcuts for the basic functions of the app."
          },
          {
            "note": "Added support for reduced motion. You can enable reduced motion in Settings > Accessibility."
          },
          {
            "note": "Added Genres to the app. You can view details related to the genre in GenreInfoPage by clicking on a genre."
          },
          {
            "note": "Now the app window will blur the title bar when the app loses focus."
          },
          {
            "note": "Now enabling song indexing from Settings > Accessibility will number the songs."
          },
          {
            "note": "In CurrentQueuePage, app will direct you to the current playing song by scrolling it to the center of the window."
          },
          {
            "note": "Added support for repeat and repeat-1 to keep listening to your loved songs all day long."
          },
          {
            "note": "Added a loading animation for the notification bar."
          },
          {
            "note": "Now users can restore their blacklisted songs from the Settings Page."
          },
          {
            "note": "Now the app can be configured to start on system startup."
          },
          {
            "note": "Added a button for the users to open the Devtools or the log file in Settings > About."
          },
          {
            "note": "Frequently used data such as songs, artists, playlists etc will be cached inside the app at runtime."
          },
          {
            "note": "Song lyrics will also be cached in the app until the relevant song finishes."
          },
          {
            "note": "Now some parts of the UI such as HomePage will be updated on data modifications. These modifications include new songs, recently played songs etc."
          },
          {
            "note": "Updated some functions to support pagination and sorting features to remove some burden off the renderer."
          }
        ],
        "fixed": [
          {
            "note": "Fixed a security vulnerability related to package 'sharp'."
          },
          {
            "note": "Removed unnecessary css styles and optimized the styling of the app."
          },
          {
            "note": "Fixed a possibility of duplicating songs by adding the same folder again."
          },
          {
            "note": "Fixed a bug related to not deleting app data after an app reset."
          },
          {
            "note": "Fixed a bug related to over-rendering of react components when a song is playing resulting higher consumption of cpu and memory. This also fixes the jitter when scrolling."
          },
          {
            "note": "Removed unnecessary context menu options from the HomePage."
          },
          {
            "note": "Fixed a bug related to parsing songs that are still being written to the system."
          },
          {
            "note": "Fixed a bug where removing a song from the system will identify as a blacklisted song by the app."
          },
          {
            "note": "Now the context menu will appear relevant to the available width and height of the window."
          },
          {
            "note": "Fixed an error where some functions are coded asynchronous but are actually synchronous."
          },
          {
            "note": "Fixed a bug where newly added songs won't be added to the library."
          }
        ],
        "knownIssues": [
          {
            "note": "There is still a small amount of unwanted cpu consumption due to over-rendering of components."
          },
          {
            "note": "Blacklisting or removing a song from the library isn't working as intended."
          }
        ]
      }
    },
    {
      "version": "0.5.0-alpha",
      "releaseDate": "2022 May 22",
      "notes": {
        "new": [
          {
            "note": "Now queues and some other features save their states between sessions (Experimental)."
          },
          {
            "note": "Now Currently Playing Queue shows information about the current queue including playlist name, artwork etc (Experimental)."
          },
          {
            "note": "Updated settings page to provide information about app version, github repository etc (Experimental)."
          },
          {
            "note": "Now users can remove songs from the library, move to the recycle bin or delete permanently from the system. Removed songs from the library will be blacklisted. (Experimental)"
          },
          {
            "note": "Now logger stores some information about the current system. This includes cpu model, architechture, platform, os and system memory."
          },
          {
            "note": "A new event added to detect app quits to provide methods to persist session data."
          },
          {
            "note": "Now playlists, albums, and artists' songs can be played by adding it to the queue."
          },
          {
            "note": "Now albums and artists support context menu options."
          },
          {
            "note": "Now online pictures of the artists will be shown thoughout the app after watching their profile."
          },
          {
            "note": "Added a song blacklist function. Now songs removed from the library will be blacklisted and can be restored from the settings page. (Experimental)"
          },
          {
            "note": "Added new images that will be displayed in situations like when the songs are loading and when there's no songs etc."
          },
          {
            "note": "Now searchPage shows results about playlists."
          },
          {
            "note": "Now some information about artist data and album data is saved with song data."
          },
          {
            "note": "Now you can view all the search results related to your query by clicking 'See All' buttons of specific categories in searchPage."
          },
          {
            "note": "Created new components Button and Checkbox."
          },
          {
            "note": "Added new buttons in ArtistInfoPage, AlbumInfoPage, PlaylistInfoPage, CurrentQueuePage to provide functions like play all, shuffle and play, and add to queue etc."
          }
        ],
        "fixed": [
          {
            "note": "Fixed a bug related to dependencies."
          },
          {
            "note": "Updated parseSong to differentiate between currently added songs and new songs. Previously this problem will duplicate the data related to the song in the library."
          },
          {
            "note": "Fixed some music playback issues."
          },
          {
            "note": "Fixed some issues related to queuing songs."
          },
          {
            "note": "Updated and improved the styles of the app."
          },
          {
            "note": "Now number of listens of a song will be updated if the song is listened repeatedly by using repeat function."
          },
          {
            "note": "Updated artist online information apis."
          }
        ],
        "knownIssues": [
          {
            "note": "Sometimes newly added songs won't be added to the library. The workaround is to reset the app and linking the relevant folder again."
          },
          {
            "note": "Shuffle and Repeat states currently is not presisting states between sessions."
          },
          {
            "note": "Resync songs context menu option isn't working as intended."
          },
          {
            "note": "Scrolling in a page when is a song is playing reduces smoothness of the app due excessive rendering."
          }
        ]
      }
    },
    {
      "version": "0.4.1-alpha",
      "releaseDate": "2022 May 16",
      "notes": {
        "new": [
          {
            "note": "Now Currently Playing Queue shows information about the current queue including playlist name, artwork etc (Experimental)."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    },
    {
      "version": "0.4.0-alpha",
      "releaseDate": "2022 May 14",
      "notes": {
        "new": [
          {
            "note": "Added song queuing. Now users can queue songs."
          },
          {
            "note": "Adding a new song will now inform the user about the new song adding process."
          },
          {
            "note": "Added a context menu option in the homepage to reset the app."
          },
          {
            "note": "Now the app will inform the user if it couldn't find the lyrics."
          },
          {
            "note": "Added a current queue page to view the current queue of songs."
          },
          {
            "note": "Now you can remove a song from the library."
          },
          {
            "note": "Now you can remove a linked media folder."
          },
          {
            "note": "Added an experimental mini player."
          },
          {
            "note": "Added the feature to remove playlists."
          },
          {
            "note": "Added a function that provides navigation previous pages. Now users can click backward button in the title bar to go to their previously visited page."
          },
          {
            "note": "Added an ErrorPrompt to inform users about possible errors."
          },
          {
            "note": "Now artists, albums and playlists show how much hours of songs they have."
          },
          {
            "note": "Added the settings page with options to update theme, music folders, and default page."
          },
          {
            "note": "Now songsPage shows how many songs in the library."
          }
        ],
        "fixed": [
          {
            "note": "Improved sorting of songs, artists, and albums. Now they work as intended."
          },
          {
            "note": "Updated launch.json files in vscode to support debugging both main and renderer processes."
          },
          {
            "note": "Renamed DialogMenu menu to notification panel."
          },
          {
            "note": "Removed unnecessary svg icons."
          },
          {
            "note": "Fixed some bugs related to parsing songs."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.3.1-alpha",
      "releaseDate": "2022 May 07",
      "notes": {
        "new": [
          {
            "note": "Migration from FontAwesome icons to Google Material Icons."
          },
          {
            "note": "Added nanoid to create unique ids for songs, artists and albums."
          },
          {
            "note": "Added node-id3 to provide support for future id3 tag editing."
          },
          {
            "note": "Added support for icons in the context menu."
          },
          {
            "note": "Added a home page context menu item to resync songs."
          }
        ],
        "fixed": [
          {
            "note": "Improved styles to support Google material icons functionality."
          },
          {
            "note": "Improved sorting of songs, artists and albums."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.3.0-alpha",
      "releaseDate": "2022 May 02",
      "notes": {
        "new": [
          {
            "note": "Added function to sort songs, artists and albums."
          },
          {
            "note": "Added a PlaylistsInfoPage to display information related to playlists."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    },
    {
      "version": "0.2.0-alpha",
      "releaseDate": "2022 April 29",
      "notes": {
        "new": [
          {
            "note": "Added new styles for AlbumInfoPage, ArtistInfoPage, and updated some styles on other componenets."
          },
          {
            "note": "Now ArtistInfoPage shows information of the artists from internet."
          }
        ],
        "fixed": [
          {
            "note": "Fixed some bugs when parsing songs."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.1.1-alpha",
      "releaseDate": "2022 April 01",
      "notes": {
        "new": [
          {
            "note": "Added a context menu option for songs to open them in the File Explorer."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    },
    {
      "version": "0.1.0-alpha",
      "releaseDate": "2022 April 01",
      "notes": {
        "new": [
          {
            "note": "Added a feature to monitor song listening patterns of the user for better shuffling."
          },
          {
            "note": "Partial playlists support for the app. (Currently you can only add playlists.)"
          },
          {
            "note": "Favorites playlist and History playlist added to the playlist pane."
          },
          {
            "note": "Added a Dialog menu to display messages."
          },
          {
            "note": "Added a prompt menu."
          },
          {
            "note": "Favorites playlist and History playlist added to the playlist pane."
          },
          {
            "note": "Context menu now supports individual element context items."
          },
          {
            "note": "Added an experimental Song Info page."
          }
        ],
        "fixed": [
          {
            "note": "Fixed bugs related to instant identification of newly added songs."
          },
          {
            "note": "Fixed some bugs in the search feature."
          },
          {
            "note": "Fixed context menu bugs."
          },
          {
            "note": "Fixed some styling issues in the UI."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.0.1-alpha",
      "releaseDate": "2022 April 01",
      "notes": {
        "new": [
          {
            "note": "Initial alpha release."
          },
          {
            "note": "Added a lyrics pane which shows lyrics according to the current song."
          },
          {
            "note": "Instant identification of newly added songs."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    }
  ]
}
