{
  "latestVersion": {
    "version": "1.0.0-alpha.20230216",
    "phase": "alpha",
    "releaseDate": "2022 October 30",
    "artwork": "/assets/other/release artworks/whats-new-v1.0.0-alpha.png"
  },
  "versions": [
    {
      "version": "1.0.0-alpha.20230216",
      "releaseDate": "2022 October 30",
      "notes": {
        "new": [
          {
            "note": "Oto Music for Desktop rebranded as Nora."
          },
          {
            "note": "Now users can fetch song metadata from internet and update their songs. (Experimental)"
          },
          {
            "note": "Support for Synced Lyrics."
          },
          {
            "note": "Lyrics from Musixmatch (Experimental)."
          },
          {
            "note": "Now users can select multiple songs, artists etc and do specific tasks with them. (Experimental)"
          },
          {
            "note": "Now users can go back and forward when going through different pages. (Experimental)"
          },
          {
            "note": "New background artworks when viewing ArtistsPage, SongInfoPage etc."
          },
          {
            "note": "Now users can like/dislike artists."
          },
          {
            "note": "Now users can add artworks to user-created playlists."
          },
          {
            "note": "Now users can sort playlists."
          },
          {
            "note": "New metrics about listening patterns of a song in SongInfoPage. (Experimental)"
          },
          {
            "note": "Now users can clear search history results."
          },
          {
            "note": "Now users can play songs in a specific genre directly from the GenreInfoPage."
          }
        ],
        "fixed": [
          {
            "note": "Updated some keyboard shortcuts of the app."
          },
          {
            "note": "Fixed a bug where adding a new music folder and adding songs to that folder wouldn't update the music library of the app."
          },
          {
            "note": "Fixed a bug where deleting a music folder from the system wouldn't update the music library of the app."
          },
          {
            "note": "Fixed a bug where always on top function of Mini Player is not working as expected."
          },
          {
            "note": "Fixed a bug where HomePage not showing the correct recently played songs."
          },
          {
            "note": "Fixed a bug where context menus are not positioning as expected."
          },
          {
            "note": "Fixed a bug where checking for app updates is not working as expected."
          },
          {
            "note": "Fixed a bug where Lyrics on some songs aren't being read by the app."
          },
          {
            "note": "Fixed some accessibility issues."
          }
        ],
        "knownIssues": [
          {
            "note": "Sometimes users can get unexpected search results when using Search."
          },
          {
            "note": "Parsing a big music library could sometimes make the app unresponsive. Currently, the only solution is to wait some time until the parsing process finishes and the app regains responsiveness."
          },
          {
            "note": "App theme will be changed when you change your system's theme even though you didn't select to use system theme in the app."
          },
          {
            "note": "If a song is added next to the last song of the queue, the last song won't be played."
          },
          {
            "note": "Trying to play corrupted songs will make the app player unusable. Workaround is to play the next song and restart the renderer using F5 button."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          }
        ]
      }
    },
    {
      "version": "0.8.0-alpha",
      "releaseDate": "2022 August 19",
      "notes": {
        "new": [
          {
            "note": "Double-clicking on a supported song in the File Explorer would play it on the app. Be sure if you made Nora the default audio player for the respective audio file. (Experimental)"
          },
          {
            "note": "Now users can drag and drop a supported audio file to play it on the player. (Experimental)"
          },
          {
            "note": "Now users can edit song id3 tags. (Experimental)"
          },
          {
            "note": "Greatly improved app performance when opening large audio libraries in pages."
          },
          {
            "note": "Theme switching according the system theme."
          },
          {
            "note": "Now users can select whether the song duration or the song remaining duration should be displayed."
          },
          {
            "note": "Updated taskbar thumbnail buttons to support the system theme."
          },
          {
            "note": "App now checks for updates every 15 minutes and inform the user if an update is available."
          }
        ],
        "fixed": [
          {
            "note": "Updated the app installer and reduced the file size of the installer by 13%."
          },
          {
            "note": "Fixed a bug where editing song tags could remove the artwork of a song."
          },
          {
            "note": "Fixed a bug where using search features on songs metadata editing page updates the search history."
          },
          {
            "note": "Fixed a bug where adding a previously parsed folder would parse the same folder."
          }
        ],
        "knownIssues": [
          {
            "note": "Parsing a big music library could sometimes make the app unresponsive. Currently, the only solution is to wait some time until the parsing process finishes and the app regains responsiveness."
          },
          {
            "note": "App theme will be changed when you change your system's theme even though you didn't select to use system theme in the app."
          },
          {
            "note": "Lyrics on some songs aren't being read by the app. Still you will be able to see lyrics from the internet."
          },
          {
            "note": "If a song is added next to the last song of the queue, the last song won't be played."
          },
          {
            "note": "Trying to play corrupted songs will make the app player unusable. Workaround is to play the next song and restart the renderer using F5 button."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          }
        ]
      }
    },
    {
      "version": "0.7.0-alpha",
      "releaseDate": "2022 July 29",
      "notes": {
        "new": [
          {
            "note": "Now you can play .ogg and .wav files in the app. (Experimental)"
          },
          {
            "note": "Added a new Release Notes Page to check for app updates and to see what the updates change in the app."
          },
          {
            "note": "Rewrote the whole app's UI with TailwindCSS. This migration revamped the whole UI of the app and updated the components and pages to be responsive to different screen sizes. (Experimental)"
          },
          {
            "note": "Option to view open source licenses used by the app."
          },
          {
            "note": "Diamensions and positions of the windows will now be saved."
          },
          {
            "note": "Updated the search functionality of the app. Now users can see their recent searches for content. Search will suggest keywords if you typed something wrong in the search bar. Now Search supports results from Genres."
          },
          {
            "note": "Songs and artists you love most are now on your home page."
          },
          {
            "note": "Updated notifications with improved UI and UX that supports buttons to provide additional functionality."
          },
          {
            "note": "Added all-time most and least listened, monthly most and least listened and artist name as sort options for songs."
          },
          {
            "note": "Now the app will be more responsive towards newtwork interruptions and act accordingly without giving you a headache."
          },
          {
            "note": "Now pages are more responsive to data updates."
          },
          {
            "note": "Now users can make the mini player stay on top of other windows."
          },
          {
            "note": "Playlists with full functionality is here. Now users can create new playlists, add songs to them, remove songs inside them or delete playlists completely. This is huge success when compared to the previous version."
          },
          {
            "note": "Users now can clear the song history from the app."
          },
          {
            "note": "Now the way users sort content will be saved to provide easier access to content that they need most."
          },
          {
            "note": "Added a new volume fade transition when the user toggles between play and pause of a song. (Experiemental)"
          },
          {
            "note": "New prompt to verify links before directing users to the link."
          }
        ],
        "fixed": [
          {
            "note": "Improved the algorithm used to shuffle the queue and playlists. Now songs in them should be more random."
          },
          {
            "note": "Improved data updates detection."
          },
          {
            "note": "Fixed some bugs related to parsing songs, blacklisting a song and restoring songs from the blacklist."
          },
          {
            "note": "Fixed a bug where parsing a song after a read error would parse the song two times."
          },
          {
            "note": "Fixed a bug related to resetting the app."
          },
          {
            "note": "Improved the song parsing process of the app."
          },
          {
            "note": "Fixed some bugs related to the player."
          },
          {
            "note": "Fixed a bug where deleting a song from the library or deleting from the system wouldn't update the library."
          },
          {
            "note": "Updated various components with improved UI and UX."
          },
          {
            "note": "Updated the songs tags editing page and fixed some bugs related to editing the tags of the song."
          }
        ],
        "knownIssues": [
          {
            "note": "Editing song tags could remove the artwork of the song."
          },
          {
            "note": "Sometimes adding a song to play next would only add it to the queue instead of adding it next to the current song."
          },
          {
            "note": "There is still a small amount of unwanted cpu consumption due to over-rendering of components."
          }
        ]
      }
    },
    {
      "version": "0.6.0-alpha",
      "releaseDate": "2022 June 24",
      "notes": {
        "new": [
          {
            "note": "Added the support to edit song id3 tags. Right click on a song and click Edit songs tags to go to the SongID3TagEditorPage. Currently changes to those data wouldn't be updated on the app. (Experimental)"
          },
          {
            "note": "Added the basement to provide support for m3u files to import and export playlists."
          },
          {
            "note": "Artist artworks will be updated when the user listens to their songs."
          },
          {
            "note": "Added keyboard shortcuts for the basic functions of the app."
          },
          {
            "note": "Added support for reduced motion. You can enable reduced motion in Settings > Accessibility."
          },
          {
            "note": "Added Genres to the app. You can view details related to the genre in GenreInfoPage by clicking on a genre."
          },
          {
            "note": "Now the app window will blur the title bar when the app loses focus."
          },
          {
            "note": "Now enabling song indexing from Settings > Accessibility will number the songs."
          },
          {
            "note": "In CurrentQueuePage, app will direct you to the current playing song by scrolling it to the center of the window."
          },
          {
            "note": "Added support for repeat and repeat-1 to keep listening to your loved songs all day long."
          },
          {
            "note": "Added a loading animation for the notification bar."
          },
          {
            "note": "Now users can restore their blacklisted songs from the Settings Page."
          },
          {
            "note": "Now the app can be configured to start on system startup."
          },
          {
            "note": "Added a button for the users to open the Devtools or the log file in Settings > About."
          },
          {
            "note": "Frequently used data such as songs, artists, playlists etc will be cached inside the app at runtime."
          },
          {
            "note": "Song lyrics will also be cached in the app until the relevant song finishes."
          },
          {
            "note": "Now some parts of the UI such as HomePage will be updated on data modifications. These modifications include new songs, recently played songs etc."
          },
          {
            "note": "Updated some functions to support pagination and sorting features to remove some burden off the renderer."
          }
        ],
        "fixed": [
          {
            "note": "Fixed a security vulnerability related to package 'sharp'."
          },
          {
            "note": "Removed unnecessary css styles and optimized the styling of the app."
          },
          {
            "note": "Fixed a possibility of duplicating songs by adding the same folder again."
          },
          {
            "note": "Fixed a bug related to not deleting app data after an app reset."
          },
          {
            "note": "Fixed a bug related to over-rendering of react components when a song is playing resulting higher consumption of cpu and memory. This also fixes the jitter when scrolling."
          },
          {
            "note": "Removed unnecessary context menu options from the HomePage."
          },
          {
            "note": "Fixed a bug related to parsing songs that are still being written to the system."
          },
          {
            "note": "Fixed a bug where removing a song from the system will identify as a blacklisted song by the app."
          },
          {
            "note": "Now the context menu will appear relevant to the available width and height of the window."
          },
          {
            "note": "Improved app functionality to reduce number of requests to apis to fetch data."
          },
          {
            "note": "Fixed a bug where newly added songs won't be added to the library."
          }
        ],
        "knownIssues": [
          {
            "note": "There is still a small amount of unwanted cpu consumption due to over-rendering of components."
          },
          {
            "note": "Blacklisting or removing a song from the library isn't working as intended."
          }
        ]
      }
    },
    {
      "version": "0.5.0-alpha",
      "releaseDate": "2022 May 22",
      "notes": {
        "new": [
          {
            "note": "Now queues and some other features save their states between sessions (Experimental)."
          },
          {
            "note": "Now Currently Playing Queue shows information about the current queue including playlist name, artwork etc (Experimental)."
          },
          {
            "note": "Updated settings page to provide information about app version, github repository etc (Experimental)."
          },
          {
            "note": "Now users can remove songs from the library, move to the recycle bin or delete permanently from the system. Removed songs from the library will be blacklisted. (Experimental)"
          },
          {
            "note": "Now logger stores some information about the current system. This includes cpu model, architechture, platform, os and system memory."
          },
          {
            "note": "A new event added to detect app quits to provide methods to persist session data."
          },
          {
            "note": "Now playlists, albums, and artists' songs can be played by adding it to the queue."
          },
          {
            "note": "Now albums and artists support context menu options."
          },
          {
            "note": "Now online pictures of the artists will be shown thoughout the app after watching their profile."
          },
          {
            "note": "Added a song blacklist function. Now songs removed from the library will be blacklisted and can be restored from the settings page. (Experimental)"
          },
          {
            "note": "Added new images that will be displayed in situations like when the songs are loading and when there's no songs etc."
          },
          {
            "note": "Now searchPage shows results about playlists."
          },
          {
            "note": "Now some information about artist data and album data is saved with song data."
          },
          {
            "note": "Now you can view all the search results related to your query by clicking 'See All' buttons of specific categories in searchPage."
          },
          {
            "note": "Created new components Button and Checkbox."
          },
          {
            "note": "Added new buttons in ArtistInfoPage, AlbumInfoPage, PlaylistInfoPage, CurrentQueuePage to provide functions like play all, shuffle and play, and add to queue etc."
          }
        ],
        "fixed": [
          {
            "note": "Fixed a bug related to dependencies."
          },
          {
            "note": "Updated parseSong to differentiate between currently added songs and new songs. Previously this problem will duplicate the data related to the song in the library."
          },
          {
            "note": "Fixed some music playback issues."
          },
          {
            "note": "Fixed some issues related to queuing songs."
          },
          {
            "note": "Updated and improved the styles of the app."
          },
          {
            "note": "Now number of listens of a song will be updated if the song is listened repeatedly by using repeat function."
          },
          {
            "note": "Updated artist online information apis."
          }
        ],
        "knownIssues": [
          {
            "note": "Sometimes newly added songs won't be added to the library. The workaround is to reset the app and linking the relevant folder again."
          },
          {
            "note": "Shuffle and Repeat states currently is not presisting states between sessions."
          },
          {
            "note": "Resync songs context menu option isn't working as intended."
          },
          {
            "note": "Scrolling in a page when is a song is playing reduces smoothness of the app due excessive rendering."
          }
        ]
      }
    },
    {
      "version": "0.4.1-alpha",
      "releaseDate": "2022 May 16",
      "notes": {
        "new": [
          {
            "note": "Now Currently Playing Queue shows information about the current queue including playlist name, artwork etc (Experimental)."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    },
    {
      "version": "0.4.0-alpha",
      "releaseDate": "2022 May 14",
      "notes": {
        "new": [
          {
            "note": "Added song queuing. Now users can queue songs."
          },
          {
            "note": "Adding a new song will now inform the user about the new song adding process."
          },
          {
            "note": "Added a context menu option in the homepage to reset the app."
          },
          {
            "note": "Now the app will inform the user if it couldn't find the lyrics."
          },
          {
            "note": "Added a current queue page to view the current queue of songs."
          },
          {
            "note": "Now you can remove a song from the library."
          },
          {
            "note": "Now you can remove a linked media folder."
          },
          {
            "note": "Added an experimental mini player."
          },
          {
            "note": "Now you can remove playlists."
          },
          {
            "note": "Added a function that provides navigation previous pages. Now users can click backward button in the title bar to go to their previously visited page."
          },
          {
            "note": "Added an ErrorPrompt to inform users about possible errors."
          },
          {
            "note": "Now artists, albums and playlists show how much hours of songs they have."
          },
          {
            "note": "Added the settings page with options to update theme, music folders, and default page."
          },
          {
            "note": "Now songsPage shows how many songs in the library."
          }
        ],
        "fixed": [
          {
            "note": "Improved sorting of songs, artists, and albums. Now they work as intended."
          },
          {
            "note": "Improved user interface."
          },
          {
            "note": "Renamed DialogMenu menu to notification panel."
          },
          {
            "note": "Improved detection of songs that got added while the app is running and not running."
          },
          {
            "note": "Fixed some bugs related to parsing songs."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.3.1-alpha",
      "releaseDate": "2022 May 07",
      "notes": {
        "new": [
          {
            "note": "Migration from FontAwesome icons to Google Material Icons."
          },
          {
            "note": "Added nanoid to create unique ids for songs, artists and albums."
          },
          {
            "note": "Added node-id3 to provide support for future id3 tag editing."
          },
          {
            "note": "Added support for icons in the context menu."
          },
          {
            "note": "Added a home page context menu item to resync songs."
          }
        ],
        "fixed": [
          {
            "note": "Improved creation and optimization of cover arts."
          },
          {
            "note": "Improved sorting of songs, artists and albums."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.3.0-alpha",
      "releaseDate": "2022 May 02",
      "notes": {
        "new": [
          {
            "note": "Added function to sort songs, artists and albums."
          },
          {
            "note": "Added a PlaylistsInfoPage to display information related to playlists."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    },
    {
      "version": "0.2.0-alpha",
      "releaseDate": "2022 April 29",
      "notes": {
        "new": [
          {
            "note": "Added new styles for AlbumInfoPage, ArtistInfoPage, and updated some styles on other componenets."
          },
          {
            "note": "Now ArtistInfoPage shows information of the artists from internet."
          }
        ],
        "fixed": [
          {
            "note": "Fixed some bugs when parsing songs."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.1.1-alpha",
      "releaseDate": "2022 April 01",
      "notes": {
        "new": [
          {
            "note": "Added a context menu option for songs to open them in the File Explorer."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    },
    {
      "version": "0.1.0-alpha",
      "releaseDate": "2022 April 01",
      "notes": {
        "new": [
          {
            "note": "Added a feature to monitor song listening patterns of the user for better shuffling."
          },
          {
            "note": "Partial playlists support for the app. (Currently you can only add playlists.)"
          },
          {
            "note": "Favorites playlist and History playlist added to the playlist pane."
          },
          {
            "note": "Added a Dialog menu to display messages."
          },
          {
            "note": "Added a prompt menu."
          },
          {
            "note": "Favorites playlist and History playlist added to the playlist pane."
          },
          {
            "note": "Context menu now supports individual element context items."
          },
          {
            "note": "Added an experimental Song Info page."
          }
        ],
        "fixed": [
          {
            "note": "Fixed bugs related to instant identification of newly added songs."
          },
          {
            "note": "Fixed some bugs in the search feature."
          },
          {
            "note": "Fixed context menu bugs."
          },
          {
            "note": "Fixed some styling issues in the UI."
          }
        ],
        "knownIssues": []
      }
    },
    {
      "version": "0.0.1-alpha",
      "releaseDate": "2022 April 01",
      "notes": {
        "new": [
          {
            "note": "Initial alpha release."
          },
          {
            "note": "Added a lyrics pane which shows lyrics according to the current song."
          },
          {
            "note": "Instant identification of newly added songs."
          }
        ],
        "fixed": [],
        "knownIssues": []
      }
    }
  ]
}
